Revit 2027 API
WallSweepInfo.CutsWall Property
 Indicates if you want the sweep to cut geometry out of the host wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CutsWall { get; set; }
Public Property CutsWall As Boolean
	Get
	Set
public:
property bool CutsWall {
	bool get ();
	void set (bool value);
}
member CutsWall : bool with get, set
Property Value
Boolean
Remarks
 When a sweep is offset and embedded in the wall, it cuts the geometry from the wall.
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace